

var code_msg = {
	0 			:	null,

	1           :   'success ',

	//errCode	:	errMsg
	99 			:	'系统错误',

	//1、用户模块 user
	100 		:	'请先登录',
	101 		:	'请输入邮箱',
	102 		:	'请输入正确的邮箱格式',
	103 		:	'请输入用户名',
	104 		:	'用户名不能超过20个字',
	105 		:	'不可以使用系统名称',
	106 		:	'请输入密码',
	107 		:	'密码不能少于6个字',
	108 		:	'密码不能大于 20 个字',
	109 		:	'请选择性别',
	110 		:	'性别参数出错',
	111 		:	'自我介绍不能超过100个字',
	112 		:	'该邮箱已被注册',
	113 		:	'哎哟，该名字已经被抢了啦',
	114 		:	'图片上传失败',
	115 		:	'邮箱或密码错误',
	116 		:	'该账号已被封',
	117 		:	'关键字不能为空',
	119 		:	'该邮箱尚未注册',
	120 		:	'用户名含有非法词汇或字符',
	121 		:	'个人简介含有非法词汇或字符',
	122 		:	'哎哟，该名字已经被抢了啦',

	//2、尝试模块 plan
	201 		:	'标题不能为空',
	202 		:	'标题过长！超过100个字',
	203 		:	'开始时间出错',
	204 		:	'内容不能超过100个字',
	205 		:	'图片上传失败',
	206 		:	'参数出错',
	207 		:	'创建时间出错',
	208 		:	'记录信息不能为空',
	210 		:	'找不到该尝试',
	211 		:	'该尝试已结束',
	212 		:	'该尝试未开始',
	213 		:	'今天已经打过卡了',
	220 		:	'关键字不能为空',
	221 		:	'标题含有非法词汇或字符'

};

module.exports = function(num, data){
	if(num > 0){
		console.log(code_msg[num]);

	}
	var r_data = data || null;
	return {
		'errMsg': code_msg[num],	//提示语[str]
		'errCode': num,				//返回信息[int]
		'data': r_data			//返回数据
	};
};